package migu;

/**
 *
 * 题目：生化危机

 项目需求：1. 放了暑假的酸奶同学一天到晚都泡在咪咕视频上看电影，这一天他刚看了《生化危机》就做了个梦，梦里发现自己到了保护伞公司，里面可全都是怪物呀！酸奶逃到一扇门前，发现门旁边的触摸屏上写着以下内容： 初始字符串 S=“CDB” 初始字符串 T=“ABC” Loading… 字符串 T=“ABCBCD” Now 初始字符串 S=“ACDBCB” 初始字符串 T=“”(空) Loading… 请输入字符串T=“？”。 酸奶观察了半天发现得到T的操作如下： ①从S的头部删除一个字符，加到T的尾部。 ②从S的尾部删除一个字符，加到T的尾部。 目的是获得字典序尽量小的字符串T。酸奶急得不知所措。 请你完成以下程序，帮助酸奶赶紧输入答案逃出去吧。

 题目：新翻棋游戏

 项目需求：咪咕游戏最近开发一个新游戏“新翻棋”，游戏规则是：有一个M*N的棋盘，每一个棋子可以翻转正反两面，一面是黑，一面是白。黑色的棋子翻转过来就是白色， 反之，白转黑。每翻转一个棋子时，与它上下左右相邻接的棋子也会一起翻转。所有棋子翻转成白色即胜利，游戏结束。请设计一个算法，用尽可能少的次数将 所有棋子翻成白色。求出用最小翻转次数。如最小次数有多种翻转法，请输出字典序最小的一组；如解不存在，输出IMPOSSIBLE。

 *
 * Created by caiping on 2017/10/15.
 */
public class packageInfo {
}
